import * as Styled from "./aboutUs.styled";
import { ContactSection } from "@/components/Layouts";
import AboutUsHeader from "./components/AboutUsHeader";

const AboutUs: React.FC = () => {
  return (
    <Styled.AboutUs>
      <AboutUsHeader />

      <div className="about-us__body">
        <div className="about-us__descriptions-box">
          <p>
            კომპანია „აგრო-ორნამენტი“ 2020 წელს დაარსდა და წარმოადგენს საოჯახო
            კომპანიას. იგი მალევე ქვეყნის სათბურების სამშენებლო სექტორში ლიდერი
            გახდა.
          </p>
          <p>
            „აგრო-ორმანენტის“ ძირითადი საქმიანობა უკავშირდება საქართველოში
            სასათბურე სექტორს და სასათბურე პროექტების შესრულებაა, დარგის სრულ
            სპექტრს მოიცავს. კომპანია მზადაა დამკვეთს შესთავაზოს მომსახურების
            სრული პაკეტი როგორც საპროექტო და სამშენებლო სამუშაოები ისე
            ტექნოლოგიებით აღჭურვა.
          </p>
          <p>
            კომპანია დაკომპლექტებულია მაღალკვალიფიციური საინჟინრო კადრებით,
            რომელთა უმეტესობას აქვს 10 წელზე მეტი სამუშაო გამოცდილება, ხოლო მათ
            საქმიანობას ამყარებს მაღალი დონის პროფესიონალებისგან შემდგარი ძლიერი
            ადმინისტრაციული გუნდი ფინანსების, ტექნიკური დახმარების, პროექტის
            მენეჯმენტის, ხარისხის კონტროლისა თუ სხვა სფეროებიდან. დღეისათვის
            კომპანიაში დასაქმებულია 15-მდე ადამიანი.
          </p>
          <p>
            „აგრო-ორნამენტი“ განსაკუთრებულ ყურადღებას უთმობს თითოეულ დამკვეთს და
            პირნათლად ასრულებს დაკისრებულ ვალდებულებებს.
          </p>
          <p>
            კომპანია თავდაუზოგავად შრომობს იმისათვის, რომ დააკმაყოფილოს
            მაღალკონკურენტული ბაზრის მოთხოვნები და მიაწოდოს მას სწრაფი და
            ხარისხიანი მომსახურება სასათბურე სექტორში უახლესი მიღწევებისა და
            სიახლეების გათვალისწინებით.
          </p>

          <h4>საქმიანობის ძირითადი სფერო და მიმართულებები:</h4>

          <p>
            თავის კლიენტებს „აგრო-ორნამენტი“ სთავაზობს საპროექტო-სამშენებლო
            საქმიანობის სრულ პაკეტს ან მისი ნებისმიერი ნაწილის შესრულებას, მათ
            შორის:
          </p>
          <ul>
            <li>პერსონალიზებულ საკონსულტაციო მომსახურეობა</li>
            <li>სამშენებლო მომსახურეობა</li>
            <li>სათბურის დიზაინის შემუშავება</li>
            <li>ბიზნეს გეგმის შედგენა;</li>
            <li>საგრანტო კონკურსზე რეგისტრაცია;</li>
            <li>საბუთების მოწესრიგებაში.</li>
            <li>სასათბურე ტექნოლოგიები</li>
            <li>სასათბურე სამშენებლო მასალები</li>
            <li>სათბურის ტექნოლოგიური აღჭურვა</li>
          </ul>
        </div>

        <ContactSection />
      </div>
    </Styled.AboutUs>
  );
};

export default AboutUs;
