import * as Styled from "./privacyPolicy.styled";
import AboutUsHeader from "./components/AboutUsHeader";

const PrivacyPolicy: React.FC = () => {
  return (
    <Styled.PrivacyPolicy>
      <AboutUsHeader />

      <div className="policy__body">
        <div className="policy__descriptions-box">
          <div className="policy__descriptions-box__block">
            <h4>ტერმინთა განმარტება</h4>

            <ol>
              <li>
                <strong>ორგანიზაცია</strong> - პირი რომელიც საქართველოს
                კანონმდებლობის შესაბამისად არის რეგისტრირებული (როგორც
                იურიდიული, ისე ფიზიკური პირი) და გააჩნია უფლებამოსილება
                გამოიყენოს წინამდებარე წესების და პირობების შესაბამისად
                მომსახურების მიწოდების კანონიერი უფლება.
              </li>

              <li>
                <strong>მომხმარებელი</strong> - საქართველოს კანონმდებლობის
                შესაბამისად რეგისტრირებული ფიზიკური ან იურიდიული პირი.
              </li>

              <li>
                <strong>მესამე პირი</strong> - საქართველოს კანონმდებლობის
                შესაბამისად ფიზიკური ან იურიდიული პირი, გარდა ორგანიზაციისა და
                მომხმარებლისა.
              </li>

              <li>
                <strong>პერსონალური მონაცემი (შემდგომ − მონაცემი)</strong> −
                ნებისმიერი ინფორმაცია, რომელიც უკავშირდება მომხმარებელს და
                ხელმისაწვდომი გახდა რეგისტრაციის გავლის შედეგად, ან ზოგადად
                ხელმისაწვდომია მის სოციალურ პროფილ(ებ)ზე, ან სხვა საკომუნიკაციო
                საშუალებებით.
              </li>

              <li>
                <strong>თანხმობა</strong> − მომხმარებლის მიერ თავისუფალი ნების
                გამოხატვით შესაბამისი ინფორმაციის მიღების შემდეგ მის შესახებ
                მონაცემთა განსაზღვრული მიზნით დამუშავებაზე, რეგისტრაციით,
                შესაბამისი მომსახურებით სარგებლობის დაწყებით ან/და სხვა
                საშუალებით გამოხატული ნებაყოფლობითი ქმედება, რომელიც გამოხატავს
                მომხმარებლის მხრიდან წინამდებარე წესებზე და პირობებზე
                დათანხმებას.
              </li>

              <li>
                <strong>მარკეტინგი / შეტყობინება</strong> − ფოსტის, სატელეფონო
                ზარების, ელექტრონული ფოსტის ან სხვა სატელეკომუნიკაციო საშუალებით
                საქონლის, მომსახურების, დასაქმების, დროებითი სამუშაოს ან სხვა
                სახის შეთავაზება რომელიც კანონით არაა აკრძალული.
              </li>

              <li>
                <strong>რეგისტრაცია</strong> - ორგანიზაციის მიერ შედგენილ
                მომსახურების მიწოდების და მონაცემთა მიღების და გამოყენების
                შესახებ წინამდებარე დოკუმენტზე თანხმობა.
              </li>
            </ol>
          </div>

          <div className="policy__descriptions-box__block">
            <h4>მომსახურების მიწოდების ზოგადი პირობები</h4>

            <ol>
              <li>
                მომხმარებელი, რომელიც წინამდებარე წესებისა და პირობების
                შესაბამისად გამოხატავს მის თავისუფალ ნებას - „თანხმობას“
                ისარგებლოს ორგანიზაციის მიერ შემოთავაზებული მომსახურებით,
                უფლებამოსილი ხდება მიიღოს მომსახურება ორგანიზაციის მიერ
                დადგენილი წესების შესაბამისად, ორგანიზაციაში მოქმედი რეგლამენტის
                და ნორმების მიხედვით.
              </li>

              <li>
                მომხმარებელი თავის მხრივ აცხადებს თანხმობას, ორგანიზაციის მიერ
                მოპოვებული მონაცემ(ებ)ი გამოყენებულ იქნეს ორგანიზაციის
                შეხედულებით, არ განხორციელდეს მათი ისეთი სახით გადაცემა,
                გასხვისება ან გამჟღავნება რის შედეგადაც დადგება მომხმარებლის
                პიროვნული ღირსების შემლახავი ფაქტი.
              </li>

              <li>
                ორგანიზაცია უფლებამოსილია გამოიყენოს მომხმარებლისაგან მოპოვებული
                მონაცემ(ებ)ი მარკეტინგული კუთხით, ამასთან მოახდინოს
                მომხმარებელთა საერთო ბაზის შექმნა, მათი ამ ბაზაში გაერთიანება,
                ჩაწერა და ასეთი სახით გადაცემა მესამე პირებისათვის, რაზეც
                წინამდებარე მომსახურების მიღებით მომხმარებელი აცხადებს
                თანხმობას.
              </li>

              <li>
                წინამდებარე წესები და პირობები შესაძლოა შეიცვალოს, დაიხვეწოს,
                რედაქტირებულ იქნეს, ორგანიზაციის შეხედულებით და მომხმარებელი
                წინასწარ გამოხატავს თანხმობას ავტომატურად ჩაერთოს წინამდებარე
                განახლებაში და თანახმაა ავტომატურად მასზე გავრცელდეს წინამდებარე
                წესები და პირობები მის მიერ მომსახურების მომდევნო
                მიღება/სარგებლობისთანავე.
              </li>

              <li>
                მომხმარებლისათვის ცნობილია რომ წინამდებარე მომსახურებით
                სარგებლობის ჯერადობა არაა შეზღუდული და ის უფლებამოსილია
                ისარგებლოს მომსახურებით ავტომატურად, ამასთან მისთვის ცნობილია
                რომ მომსახურებით ყოველი სარგებლობისას შესაძლოა მოხდეს მონაცემთა
                ხელახალი მიღება ორგანიზაციის მიერ, მომხმარებლის მიერ
                რედაქტირებული ინფორმაციის შესაბამისად.
              </li>

              <li>
                მომსახურების მიწოდებისას მოპოვებული ინფორმაცია გამოყენებული
                იქნება მხოლოდ ორგანიზაციის კონტრაქტორი და მასთან პარტნიორულ
                ურთიერთობაში მყოფი მესამე პირებისათვის, რაზეც მომხმარებელი
                წინასწარ აცხადებს თანხმობას, ამასთან მიიღოს მონაწილეობა ასეთი
                მესამე პირების მიერ დაგეგმილ მარკეტინგულ ღონისძ იებ ებში.
              </li>
            </ol>
          </div>

          <div className="policy__descriptions-box__block">
            <h4>
              ორგანიზაციისათვის მინიჭებული უფლება, მონაცემთა შეგროვება,
              გამოყენება და უსაფრთხოება
            </h4>

            <ol>
              <li>
                მომხმარებელი სრულ უფლებას ანიჭებს ორგანიზაციას, რათა ამ
                უკანასკნელმა მისი შეხედულებით, მიიღოს, დაამუშაოს და გადასცეს მის
                მიერ ავტორიზებულ მესამე პირებს მონაცემი რომელიც მისთვის
                ხელმისაწვდომი გახდა.
              </li>

              <li>
                ორგანიზაცია კრებს და აგროვებს მონაცემებს, რომელიც საჯაროდ
                ხელმისაწვდომია, არ საჭიროებს ნებართვას რომელიმე კონკრეტულ
                პირისგან. ორგანიზაცია უფლებამოსილია შეაგროვოს, გამოიყენოს,
                გადასცეს და გაავრცელოს ასეთი მონაცემი ნებისმიერი მიზნით. ქვემოთ
                ჩამოთვლილია არასასურველი ინფორმაციის ზოგიერთი მაგალითი, რომელსაც
                ორგანიზაცია აგროვებს და როგორ შეუძლია გამოიყენოს იგი:
              </li>

              <li>
                ორგანიზაციამ შეიძლება შეკრიბოს მონაცემები, როგორიცაა ენა,
                რეგიონი, მდებარეობა და დრო ზონა, სადაც ორგანიზაცია მონაცემს
                გამოიყენებს ისე, რომ შესაძლებელია უკეთ იყოს გაგებული
                მომხმარებლის ქცევა და გაუმჯობესდეს მომსახურება, მარკეტინგი
                (შეთავაზებები, პროდუქცია, მომსახურება, და რეკლამა), როგორც
                ორგანიზაციის ასევე მასთან დაკავშირებული მესამე პირების მიერ.
              </li>

              <li>
                ორგანიზაციამ შეიძლება შეაგროვოს და შეინახოს დეტალები, თუ როგორ
                გამოიყენება მომსახურება, მათ შორის საძიებო მოთხოვნები. ეს
                მონაცემი შეიძლება გამოყენებულ იქნას ზოგადად ბაზარზე სერვისების
                და მომსახურების მოწოდებული შედეგების შესაბამისობის
                გასაუმჯობესებლად. გარდა შეზღუდული შემთხვევებისა ჩვენი
                მომსახურების ხარისხის უზრუნველსაყოფად, ასეთი ინფორმაცია არ
                იქნება დაკავშირებული თქვენი IP მისამართის და ასეთი მონაცემების
                საშუალებით.
              </li>

              <li>
                მომხმარებლის მკაფიო თანხმობით, ორგანიზაციას შეუძლია შეკრიბოს
                მონაცემები იმის შესახებ, თუ როგორ გამოიყენება მომხმარებელთა მიერ
                სხვა დასხვა ტექნოლოგიური საშუალებები, ბაზარზე კონკურენციისა და
                სერვისების გაუმჯობესების მიზნით.
              </li>

              <li>
                ორგანიზაცია ეკიდება მომხმარებლის მონაცემს უსაფრთხოდ ძალიან
                სერიოზულად. ორგანიზაციის მომსახურებით სარგებლობისას, ჩვენ ვიცავთ
                მომხმარებლის მონაცემებს სხვადასხვა ტექნოლოგიები სა და
                უსაფრთხოების ნორმების გამოყენებით. როდესაც მომხმარებლის
                მონაცემები ინახება ორგანიზაციის მიერ, ჩვენ ვიყენებთ კომპიუტერულ
                სისტემებს შეზღუდული ხელმისაწვდომობით, სადაც განთავსდება ფიზიკური
                უსაფრთხოების ზომები. მომხმარებლის მონაცემები ინახება ისეთი
                ფორმით, რომ, ის არაა ხელმისაწვდომი როდესაც ჩვენ მესამე პირების
                მონაცემთა შენახვას ვახორციელებთ.
              </li>

              <li>
                ორგანიზაციის მომსახურების მიღებისას, სოციალური ქსელის, ან
                სოციალური ქსელის სერვისით, ორგანიზაციის მომსახურების
                გამოყენებისას, თქვენს მონაცემებს გაუზიარებთ სხვა მომხმარებლებს
                და შესაძლებელია ეს მონაცემი ხელმისაწვდომი გახდეს, შეგროვდეს ან
                გამოყენებულ იქნეს ისინი. მომხმარებელი პასუხისმგებელია თავის
                მონაცემებზე, რომელიც აირჩია ან რომელსაც მიუთითებს ასეთ
                შემთხვევებში. მაგალითად, თუ თქვენი სახელი და ელექტრონული ფოსტის
                მისამართია განთავსებული საჯაროდ, ეს ინფორმაცია ხელმისაწვდომია.
                გთხოვთ გაითვალისწინოთ აღნიშნული შემთხვევები.
              </li>

              <li>
                თუ მომხმარებელი ან ვინმე სხვას იყენებთ მესამე პირის ტექნოლოგიას
                და თქვენს მონაცემებს, ასეთ შემთხვევაში გამოყენებული ნებისმიერი
                მონაცემი, შესაძლოა გახდეს საჯარო მესამე პირებისათვის გთხოვთ
                გაითვალისწინოთ აღნიშნული შემთხვევები.
              </li>

              <li>
                ორგანიზაცია შეინარჩუნებთ თქვენს ინფორმაციას რომელიც
                ხელმისაწვდომი გახდა წინამდებარე დებულებით განსაზღვრული
                მიზნებისათვის აუცილებელი პერიოდის განმავლობაში, არ არის საჭირო
                ან ნებადართულია მომხმარებლისგან ხანგრძლივი შენახვის ვადა.
              </li>
            </ol>
          </div>

          <div className="policy__descriptions-box__block">
            <h4>პასუხისმგებლობა</h4>

            <ol>
              <li>
                მომხმარებელი ვალდებულია მომსახურებით ისარგებლოს მხოლოდ კანონიერ
                ფარგლებში, არ განახორციელოს ისეთი ქმედება (მოქმედება ან
                უმოქმედობა) რის შედეგადაც ორგანიზაცის ან მესამე პირ(ებ)ს
                მიადგება რაიმე სახის ზიანი, ან დადგება მათი ღირსების შელახვის
                ფაქტი.
              </li>

              <li>
                ორგანიზაცია იღებს ვალდებულებას არ გათქვას მომხმარებლისგან
                მიღებული ის მონაცემი, გარდა კანონმდებლობით გათვალისწინებული
                შემთხვევებისა, რომელიც არის დაკავშირებული მის ფინანსურ
                ინსტიტუტებთან, კერძოდ: მომხმარებლის კოდი (ასეთის მიღების
                შემთხვევაში), მისი ფინანსური შემოსავლების, საბანკო ოპერაციების
                შესახებ.
              </li>

              <li>
                კონფიდენციალობის დარღვევად არ ჩაითვლება წინამდებარე დოკუმენტის
                მე-3 მუხლის 3.2-პუნქტის გარდა მომხმარებლისგან მიღებული მონაცემი,
                მათ შორის და არა მარტო:
              </li>

              <li>
                მომხმარებელი ვალდებულია მომსახურებით ისარგებლოს მხოლოდ კანონიერ
                ფარგლებში, არ განახორციელოს ისეთი ქმედება (მოქმედება ან
                უმოქმედობა) რის შედეგადაც ორგანიზაცის ან მესამე პირ(ებ)ს
                მიადგება რაიმე სახის ზიანი, ან დადგება მათი ღირსების შელახვის
                ფაქტი. 2.ორგანიზაცია იღებს ვალდებულებას არ გათქვას
                მომხმარებლისგან მიღებული ის მონაცემი, გარდა კანონმდებლობით
                გათვალისწინებული შემთხვევებისა, რომელიც არის დაკავშირებული მის
                ფინანსურ ინსტიტუტებთან, კერძოდ: მომხმარებლის კოდი (ასეთის
                მიღების შემთხვევაში), მისი ფინანსური შემოსავლების, საბანკო
                ოპერაციების შესახებ.
              </li>

              <li>
                მომხმარებელი ვალდებულია დაიცვას მისთვის მომსახურებით სარგებლობის
                შედეგად მიღებული ნებისმიერი მონაცემი და ინფორმაცია, მათ შორის
                წინამდებარე დოკუმენტის ტექსტი და ორგანიზაციის შესახებ მისთვის
                ხელმისაწვდომი მონაცემები.
              </li>

              <li>
                მომხმარებელი ვალდებულია, თავად აუნაზღაუროს ორგანიზაციასა და
                მესამე პირებს მისი ქმედებით მიყენებული ნებისმიერი სახის ზიანი,
                მათ შორის ფინანსური ზარალი.
              </li>

              <li>
                მომსახურების არამიზნობრივი და კანონსაწინააღმდეგო ქმედებისათვის
                გამოყენებისათვის მომხმარებელს დაუდგება სახელმწიფოს შესაბამის
                უწყებაში და შესაბამისად უფლებამოსილი ორგანოს წინაშე
                პასუხისმგებლობის საკითხი.
              </li>

              <li>
                მომხმარებელი სრულად არის პასუხისმგებელი მის მიერ მესამე პირებისა
                და ორგანიზაციისათვის მიყენებულ ნებისმიერი სახის ზარალსა თუ
                ზიანზე.
              </li>
            </ol>
          </div>

          <div className="policy__descriptions-box__block">
            <h4>რეგისტრაციის, მომსახურების მიღებისა და გამოყენების შესახებ</h4>

            <p>
              ყურადღება!!! დაწვრილებით გაეცანით წესებს, წინამდებარე მომსახურებით
              სარგებლობა შეუძლიათ მხოლოდ შესაბამისად კანონით უფლებამოსილ პირებს
              რომელსაც გააჩნიათ უფლება გამოიყენონ დარეგისტრირდნენ და ისარგებლონ
              სოციალური ქსელით. რეგისტრაცია შესაძლებელია როგორც სოციალური ქსელის
              ისე სხვა მონაცემთა გამოთხოვის, კითხვარის შევსებით და ორგანიზაციის
              მიერ შემუშავებული სხვა ფორმის საშუალებით (ასეთის არსებობის
              შემთხვევაში). მომხმარებელი გაეცნო წინამდებარე წესებს და პირობებს
              და აცხადებს რომ მისი ღირსების, ადამიანური უფლებ(ებ)ის და
              თავისუფლე(ბე)ბის შემლახველი ორგანიზაციის მიერ მონაცემთა ამ სახით
              სარგებლობაში არაფერია: ვეთანხმები ყოველივე ზემოთ მოყვანილს,
              ჩემთვის არაა ბუნდოვანი და გაუგებარი სიტყვ(ები)ა, სიტყვათა
              დაჯგუფება, ერთობლიობა, წინადადება, პუნქტი, ან რაიმე სახის
              ჩანაწერი. არ შეიცავს და არაა ჩემთვის წინამდებარე მომსახურების
              ფარგლებში აღებული მონაცემ(ებ)ი განსაკუთრებული კატეგორიის. და ასეთი
              მონაცემების გამჟღავნებაზე სრული პასუხისმგებლობა მეკისრება მე
              მომხმარებელს, როგორც საჯაროდ მათ გამომცხადებელს, სრულიად
              ვეთანხმები მომსახურებით სარგებლობის წესებს და ვაცხადებ თანხმობას
              გამოყენებულ იქნას ჩემი და ჩემს შესახებ მოპოვებული ნებისმიერი
              მონაცემი ორგანიზაციის შეხედულებით, თანახმა ვარ მივიღო მონაწილეობა
              ორგანიზაციის და მესამე პირ(ებ)ის მიერ დაგეგმილ მარკეტინგულ
              პოლიტიკაში. ყოველივე ზემოთ ხსენებულის დასტურად ვაცხადებ წერილობით
              თანხმობას ჩემს მიერ რეგისტრაციითა და მომსახურების მიღებით.
              ვაცხადებ და ვიძლევი გარანტიას რომ ვარ შესაბამისად უფლებამოსილი,
              მაქ ყველა სახის ნებართვა, ლიცენზია, თანხმობა მოპოვებული და
              ვათვითცნობიერებ ჩემს მიერ განხორციელებულ ქმედებას და ჩემს თავზე
              ვიღებ სრულ პასუხისმგებლობას წინამდებარე მომსახურების მიღებით. არ
              შემყავს ორგანიზაცია მოტყუებაში, მე როგორც სრულწლოვანი,
              არასრულწლოვანის კანონიერი მეურვე, წარმომადგენელი, მზრუნველი,
              ყოველი ქმედება განხორციელებულია ჩემს მიერ, საკუთარი ნების
              გამოსახატავად, გავეცანი და ვეთანხმები!!! ყველა უფლება დაცულია
              დამატებითი ინფორმაციისათვის მოგვმართეთ: &nbsp;
              <u>
                <strong>
                  <a href="mailto:agroornament@gmail.com">
                    agroornament@gmail.com
                  </a>
                </strong>
              </u>
            </p>
          </div>
        </div>
      </div>
    </Styled.PrivacyPolicy>
  );
};

export default PrivacyPolicy;
